public class HW3_Task1 {
    // Task 1
    // Задача №1
    //
    //Необходимо создать две целочисленные переменные (a, b), присвоить произвольные значения переменным на ваш выбор и вывести следующие строки:
    //a == b - если переменные равны
    //a < b - если переменная a меньше b
    //a > b - если переменная b меньше a

    public static void main(String[] args) {
        int a = 54;
        int b = 154;

        if (a == b) {
            System.out.println("a == b");
        } else {
            if (a < b) {
                System.out.println("a < b");
            } else {
                if (a > b) {
                    System.out.println("a > b");

                }
                ;
            }
        }

    }

}


